# St7GetNodeLabelStyle

Returns the display style for node labels.

long St7GetNodeLabelStyle(long uID, long* LabelStyle)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
LabelStyle

One of lsNone, lsEntityNumber or lsIDNumber.